Gex-devs/Elevator-PID-Project/esp32-webserver/src/main.cpp
#include <ArduinoWebsockets.h>
#include <ESP8266WiFi.h>

const char *ssid = "Ged-IOT";                               // Enter SSID
const char *password = "IOT@pass22";                       // Enter Password
const char *websockets_server_host = "192.168.0.104"; // Enter server adress
const uint16_t websockets_server_port = 32768;            // Enter server port

using namespace websockets;

void onMessageCallback(WebsocketsMessage message)
{
  Serial.print("Got Message: ");
  Serial.println(message.data());
}

void onEventsCallback(WebsocketsEvent event, String data)
{
  if (event == WebsocketsEvent::ConnectionOpened)
  {
    Serial.println("Connnection Opened");
  }
  else if (event == WebsocketsEvent::ConnectionClosed)
  {
    Serial.println("Connnection Closed");
  }
  else if (event == WebsocketsEvent::GotPing)
  {
    Serial.println("Got a Ping!");
  }
  else if (event == WebsocketsEvent::GotPong)
  {
    Serial.println("Got a Pong!");
  }
}

WebsocketsClient client;
void setup()
{
  Serial.begin(115200);
  // Connect to wifi
  WiFi.begin(ssid, password);

  // Wait some time to connect to wifi
  for (int i = 0; i < 10 && WiFi.status() != WL_CONNECTED; i++)
  {
    Serial.print(".");
    delay(1000);
  }

  // run callback when messages are received
  client.onMessage(onMessageCallback);

  // run callback when events are occuring
  client.onEvent(onEventsCallback);

  // Connect to server
  client.connect(websockets_server_host, websockets_server_port, "/");

  // Send a message
  client.send("Hello Server");

  // Send a ping
  client.ping();
}

void loop()
{
  client.poll();
}
